---
kind: type
id: T:Autodesk.Revit.DB.RevisionNumberingSequence
source: html/52b6f8d8-4d5e-dfee-7782-5cd7a77ee543.htm
---
# Autodesk.Revit.DB.RevisionNumberingSequence

Defines the sequences by which numbers are assigned to Revisions.

## Syntax (C#)
```csharp
public class RevisionNumberingSequence : Element
```

## Remarks
Revision numbering is numeric or alphanumeric. Revision numbering is assigned to Revisions to control
 the numbering scheme of that Revision.